[Local File Header #1][文件名1][文件数据1][Local File Header #2][文件名2][文件数据2]
[Central Directory File Header #1][Central Directory File Header #2]
[End Of Central Directory (EOCD)][ZIP 注释（百度自定义）]

xxd byiOSLivpMakerB1785140239500.zip | less

一个数字代表半个字节，如504b，50是一个字节




Local File Header

    
 0000 0024 6674 7970 6865 6963 0000

签名          504B 0304  固定魔数
版本          1400       提取所需最低版本，一般设为 0x0014（2.0，即 decimal 20）
通用位标志     0000       GPFlag
压缩方法       0000       0x0000 = 存储（store，无压缩）。
修改时间       2982       bit 15-11 小时(5 bit)<br/>bit 10-5 分钟(6 bit)<br/>bit 4-0 秒/2(5 bit)<br/>0x2982 = 0010 1001 1000 0010<br/>小时00101 = 5<br/>分钟001100 = 12<br/>秒/2 00010 = 2<br/> 05:12:04
修改日期       fb5c       bit 15-9 年份偏移(从1980开始)<br/>bit 8-5 月<br/>bit 4-0 日<br/>0xfb5c = 1111 1011 0101 1100<br/>年diff 1111101=125<br/>月1010=10<br/>日11100=28<br/>2105年10月28日
CRC32         9571 d173  0x73d17195 见python脚本livp3.crc.py
压缩大小       2395 0000   0x9523，`stat -f "%z" IMB_TItMiu.HEIC.heic`得38179（字节），hex(38179)=0x9523
未压缩大小     2395 0000   同上
文件名长度     1400        0x14 = len('IMB_TItMiu.HEIC.heic')
额外字段长度   0000
文件名        494d 425f 5449 744d 6975 2e48 4549 432e 6865 6963  运行`print(bytes.fromhex("494d 425f 5449 744d 6975 2e48 4549 432e 6865 6963").decode("ascii"))`可得`IMB_TItMiu.HEIC.heic`
文件数据       0000 0024 6674 7970 6865 6963 ... ...$ftypheic..

文件数据起始偏移地址 16x3+2=50
文件结束后第二个文件起始偏移地址：50 + 38179 = 0x9555

执行`xxd -s 0x9555 byiOSLivpMakerB1785140239500.zip | less`得到
00009555: 504b 0304 1400 0000 0000 2982 fb5c dbcf  PK........)..\..
00009565: 6a4e 9d54 0300 9d54 0300 1300 0000 494d  jN.T...T......IM
00009575: 425f 5449 744d 6975 2e48 4549 432e 6d6f  B_TItMiu.HEIC.mo
00009585: 7600 0000 1466 7479 7071 7420 2000 0000  v....ftypqt  ...

文件起始地址 0x9585 + 1，文件大小 218269 字节 ，ZIP下一部分Central Directory File Header #1 起始地址 0x9585 + 1 + 218269 = '0x3ea23'


执行`xxd -s 0x3ea23 byiOSLivpMakerB1785140239500.zip`得到
0003ea23: 504b 0102 0000 1400 0000 0000 2982 fb5c  PK..........)..\
0003ea33: 9571 d173 2395 0000 2395 0000 1400 0000  .q.s#...#.......
0003ea43: 0000 0000 0000 0000 0000 0000 0000 494d  ..............IM
0003ea53: 425f 5449 744d 6975 2e48 4549 432e 6865  B_TItMiu.HEIC.he
0003ea63: 6963 504b 0102 0000 1400 0000 0000 2982  icPK..........).
0003ea73: fb5c dbcf 6a4e 9d54 0300 9d54 0300 1300  .\..jN.T...T....
0003ea83: 0000 0000 0000 0000 0000 0000 5595 0000  ............U...
0003ea93: 494d 425f 5449 744d 6975 2e48 4549 432e  IMB_TItMiu.HEIC.
0003eaa3: 6d6f 7650 4b05 0600 0000 0002 0002 0083  movPK...........
0003eab3: 0000 0023 ea03 0038 0030 3030 3230 3030  ...#...8.0002000
0003eac3: 3030 3033 3230 3030 3039 3532 3330 3030  0003200009523000
0003ead3: 3330 3030 3039 3538 3630 3030 3335 3439  3000095860003549
0003eae3: 4433 3133 3033 3033 3034 4334 3935 3635  D313030304C49565
0003eaf3: 30                                       0




Central Directory File Header #1
    
签名Signature          504b 0102    固定魔数
版本VerMade            0000         创建此文件所用版本，一般也用2.0（14 00）
版本VerNeeded          1400         提取所需最低版本，同 Local Header
通用位标志GPFlag        0000         GPFlag
压缩方法CompMethod      0000         0x0000 = 存储（store，无压缩）
修改时间ModTime         2982         同Local File Header
修改日期ModDate         fb5c         同Local File Header
CRC32                 9571 d173     同Local File Header
压缩大小CompSize       2395 0000     同Local File Header
未压缩大小UncompSize    2395 0000     同Local File Header
文件名长度NameLen       1400         同Local File Header
额外字段长度ExtraLen    0000         同Local File Header
文件注释长度CommentLen  0000         代表无注释
磁盘号DiskStart        0000         此文件起始于第几号磁盘（一般0）
内部属性IntAttr         0000        内部文件属性，一般 0
外部属性ExtAttr         0000 0000   外部文件属性，一般 0
相对偏移RelOffset       0000 0000   从 ZIP 文件起始到对应 Local Header 的偏移（字节数）。示例：第一个文件偏移 0。第二个文件按此计算。
文件名                 494d 425f 5449 744d 6975 2e48 4549 432e 6865 6963 
（可选）额外字段/注释

Central Directory File Header #2

大多都与#1相同
504b 0102 0000 1400 0000 0000 2982 fb5c
CRC32：dbcf 6a4e
未压缩大小：9d54 0300
压缩大小：9d54 0300
文件名长度：1300
0000 0000 0000 0000 0000 0000
相对偏移RelOffset 5595 0000 ，符合前面计算的0x9555（也就是0x00009555）
文件名494d 425f 5449 744d 6975 2e48 4549 432e 6d6f 76 
运行`print(bytes.fromhex("494d 425f 5449 744d 6975 2e48 4549 432e 6d6f 76").decode("ascii"))`可得`IMB_TItMiu.HEIC.mov`




End of Central Directory (EOCD)：

xxd -s 0x3eaa6 byiOSLivpMakerB1785140239500.zip 
0003eaa6: 504b 0506 0000 0000 0200 0200 8300 0000  PK..............
0003eab6: 23ea 0300 3800 3030 3032 3030 3030 3030  #...8.0002000000
0003eac6: 3332 3030 3030 3935 3233 3030 3033 3030  3200009523000300
0003ead6: 3030 3935 3836 3030 3033 3534 3944 3331  0095860003549D31
0003eae6: 3330 3330 3330 3443 3439 3536 3530       3030304C495650

签名Signature             504b 0506             固定魔数，标志 EOCD 开始
当前磁盘号DiskNum          0000                  本磁盘号，一般0
CD起始磁盘号DiskStart      0000                  中央目录所在磁盘号（一般0）
磁盘内条目数EntriesOnDisk  0200                  本磁盘上的目录条目数。示例0x0002=2（图片+视频）。
总条目数TotalEntries       0200                  ZIP 文件中目录总条目数。示例2。
CD大小CDSize              8300 0000             （CD#1 46+20，CD#2 46+19，共计46+20+46+19=131=0x83）中央目录总大小（字节）。等于所有 Central 头长度之和（不含 EOCD 自身和注释）。
CD偏移CDOffset            23ea 0300             0x3eaa6-0x83=0x03ea23中央目录起始位置相对 ZIP 开始的偏移（字节数）。
注释长度CommentLen        3800                   0x38=56
注释内容                  3030 3032 3030 3030 3030 3332 3030 3030 3935 3233 3030 3033 3030 3030 3935 3836 3030 3033 3534 3944 3331 3330 3330 3330 3443 3439 3536 3530

print(bytes.fromhex("3030 3032 3030 3030 3030 3332 3030 3030 3935 3233 3030 3033 3030 3030 3935 3836 3030 3033 3534 3944 3331 3330 3330 3330 3443 3439 3536 3530").decode("ascii"))得到：000200000032000095230003000095860003549D313030304C495650

