相当于是测试大纲之前写地有点草率了（当时写测试大纲的时候这个前端界面甚至都还没做出来），现在要验证合同里的指标，可能要把之前写的不合理的地方重新写一下

之前基本上可以说是构想的项目完成之后是什么样子的，所以写了很多命令。现在很多指标图形界面上就直接显示了，那样的话就直接“在xx页面点击xx”，就不用按之前写的那样通过命令行来执行了




也就是说测试大纲里不合理的地方都可以改[捂脸]
最终是想写一个真正能操作的文档






问问GPT或者扯一下？[捂脸]

有些指标可能确实没能直接在界面里体现，不过专家们可能也不是那么懂？到时候应该就是按照测试大纲操作，看到哪里显示了一个数，一算达到了多少多少，就算通过了





要求的指标在上次测试报告的第2章节，操作的话可以理解为主要是在那个网页界面上点一些按键
界面上倒是也会显示什么东西都是什么，就尽量匹配吧

如果匹配不上就先写感觉比较像的也可以








我手边倒是没有电脑，第一次一块去的时候不是一块使用过一次吗
其实也就几个页面，就能点的都点一点呗






差不多是这样子的

或者可以理解为好好写太难写了，所以给你们提供了一个偷懒的思路